In [43]:
# import numpy and pandas
import numpy as np
import pandas as pd

In [44]:
# read several datasets
data=pd.read_csv('results/2020-07-14 2020 VIRTUAL COLONIE MILE Hudson Mohawk Road Runners Club.csv')
data.head()

,First name,Last name,Gender,e-Mail,Age,City,State,Time
0,Sharon,Lagace,Female,ronsha01@nycap.rr.com,50,Glenville,NY,12
1,Oliver,Hooper,M,hoop464@icloud.com,10,Glenville,Ny,7:25
2,Amber,Hooper,F,hoop464@icloud.com,35,Glenville,Ny,7:53
3,Joe,Keenan,Male,keenan.joe@gmail.com,60,Hudson,NY,6:54
4,Melissa,Kaszuba,Female,kaszubam511@strose.edu,33,Rexford,NY,7:53

In [45]:
def timeToSeconds(time):
    
    temp=time.split(':')
    print(len(temp))
    try:
        if (len(temp)==2):
            return 60*int(temp[0])+int(temp[1])
        elif (len(temp)==1):
            return 60*int(temp[0])
    except:
        return 100000

In [46]:
data['seconds']=data['Time'].apply(lambda x: timeToSeconds(x))
data=data.drop('e-Mail', axis=1)

1
2
2
2
2
2
2
2
2
2

In [47]:
data.head()

  First name Last name  Gender  Age       City State  Time  seconds
0     Sharon    Lagace  Female   50  Glenville    NY    12      720
1     Oliver    Hooper       M   10  Glenville    Ny  7:25      445
2      Amber    Hooper       F   35  Glenville    Ny  7:53      473
3        Joe    Keenan    Male   60     Hudson    NY  6:54      414
4    Melissa   Kaszuba  Female   33    Rexford    NY  7:53      473

In [48]:
data=data.sort_values(by='seconds')
data=data.drop('seconds',axis=1)
data.head()

  First name Last name  Gender  Age       City State  Time
3        Joe    Keenan    Male   60     Hudson    NY  6:54
1     Oliver    Hooper       M   10  Glenville    Ny  7:25
2      Amber    Hooper       F   35  Glenville    Ny  7:53
4    Melissa   Kaszuba  Female   33    Rexford    NY  7:53
5      Sarah   Pulcher  Female   41    Selkirk   NaN  8:17

In [17]:
markdown=data.to_markdown();

In [18]:
fname='leaderboard.md'
out_file=open(fname, "w")
out_file.write(markdown)
out_file.close()

In [19]:
csvname='leaderboard.csv'
data.to_csv(csvname)